windDrivenRainFoam/cubicBuildingRain/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    inlet
    {
        type            patch;
        nFaces          1200;
        startFace       137920;
    }
    outlet
    {
        type            patch;
        nFaces          1200;
        startFace       139120;
    }
    ground
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1536;
        startFace       140320;
    }
    top
    {
        type            patch;
        nFaces          1600;
        startFace       141856;
    }
    sideY1
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          1200;
        startFace       143456;
    }
    sideY2
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          1200;
        startFace       144656;
    }
    building
    {
        type            wall;
        inGroups        1(wall);
        nFaces          384;
        startFace       145856;
    }
)

// ************************************************************************* //
