windDrivenRainFoam/cubicBuildingRain/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel  Newtonian;

nu              1.5e-05;  // Kinematic viscosity of air [m^2/s]

// Number of rain phases
nPhases         5;

// Temperature [K]
temp            293.15;  // 20°C

// Reference horizontal rainfall intensity [mm/h]
Rh              50;  // Heavy rain

// Wind field scaling factor
Ustar           1.0;

// Turbulent dispersion model
turbulentDispersion false;

// Rain phase properties based on Best (1950) distribution
phases
(
    // Phase 1: Small droplets (0.5 mm diameter, 10% volume fraction)
    (0.0005  0.1)
    
    // Phase 2: Small-medium droplets (1.0 mm diameter, 20% volume fraction)
    (0.001   0.2)
    
    // Phase 3: Medium droplets (1.5 mm diameter, 30% volume fraction)
    (0.0015  0.3)
    
    // Phase 4: Medium-large droplets (2.0 mm diameter, 25% volume fraction)
    (0.002   0.25)
    
    // Phase 5: Large droplets (3.0 mm diameter, 15% volume fraction)
    (0.003   0.15)
);

// ************************************************************************* //