windDrivenRainFoam/cubicBuildingRain/system/sampleDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      sampleDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type surfaces;
libs (sampling);

setFormat raw;
interpolationScheme cell;

fields (gcr scr1 scr2 scr3 scr4 scr5);

surfaces
(
    building
    {
        type        patch;
        patches     (building);
        interpolate true;
    }
    
    buildingWindward
    {
        type        sampledTriSurfaceMesh;
        surface     buildingWindward.stl;
        source      cells;
        interpolate true;
        
        // Alternative: use cutting plane
        // type        cuttingPlane;
        // planeType   pointAndNormal;
        // point       (0 5 5);
        // normal      (1 0 0);
        // bounds      (-0.1 -0.1 -0.1) (0.1 10.1 10.1);
    }
);

// ************************************************************************* //